Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadGroup Methods
The AnalysisLoadGroup type exposes the following members.
Methods
Name | Description
GetTypeName
 Get load group type name, translated to current language.
IsEmpty
 Check if load group is empty (no loading exists).
IsSelfWeight
 Check if load group is self weight load group.
Select
 Selects an AnalysisLoadGroup. The ID has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisLoadGroup Class
Tekla.Structures.Analysis Namespace